hiromendo/CAN-STM32_DEMO1/Eclipse-Project/src/main.c
	sprintf(SlaveOutput, "\n\r0 %u\n\r1 %u\n\r2 %u\n\r3 %u\n\r4 %u\n\r5 %u\n\r6 %u\n\r7 %u\n\r", read_data[0],read_data[1],read_data[2],read_data[3],read_data[4],read_data[5],read_data[6],read_data[7]);
    HAL_UART_Transmit(&huart1, (uint8_t *)SlaveOutput, 80, TIMEOUT_VAL);

    HAL_UART_Transmit(&huart1, (uint8_t *)"RUNS TIL HERE",strlen("RUNS TIL HERE"), TIMEOUT_VAL);

	/*Enable LED if thermistor is connected*/
	//LED=9-LED;
	if (rtd_data.status < 128 ||(rtd_data.rtd_res_raw < 32767 && rtd_data.rtd_res_raw > 0))
		{
	*(LEDinit+(27-LED*2))= 0xFF;
	*(LEDinit+(26-LED*2))= 0x20;

	//for lighting up one after another
	//HAL_SPI_Transmit(&hspi1, LEDinit, 28, 10);
		}
	else if (rtd_data.status >= 128||(rtd_data.rtd_res_raw >= 32767 && rtd_data.rtd_res_raw == 0))
		{
	*(LEDinit+(27-LED*2)) = 0;
	*(LEDinit+(26-LED*2)) = 0;

	//for lighting up one after another
	//HAL_SPI_Transmit(&hspi1, LEDinit, 28, 10);
		}

  /* calculate RTD resistance */
	//5143.92 as offset for 470k resistor
	//CSnumber=CSnumber+1;
	    resistanceRTD = /*5143.92+*/((double)rtd_data.rtd_res_raw * RREF) / 32767; // Replace 4000 by 400 for PT100
		sprintf(Rrtd, "\n\rCS%i: \n\rRrtd = %0.2f\n\rRAW = %u\n\r", CSnumber+1, resistanceRTD,rtd_data.rtd_res_raw);
		HAL_UART_Transmit(&huart1, (uint8_t *)Rrtd, 60, TIMEOUT_VAL); // print RTD resistance

		//sprintf(Rrtd, "RAW = %u\n\r", rtd_data.rtd_res_raw);
		//HAL_UART_Transmit(&huart1, (uint8_t *)Rrtd, 60, TIMEOUT_VAL); // print RTD resistance

	/* calculate RTD temperature (simple calc, +/- 2 deg C from -100C to 100C) */
    /* CALCULATION OF TEMP MUST BE ADJUSTED TO RTD  */
  //  tmp = ((double)rtd_data.rtd_res_raw / 32) - 256;
	 tmp=1/(((log(/*(double)rtd_data.rtd_res_raw*/ resistanceRTD / 10000))/3435)+(1/298.15));
	//tmp=tmp-273.15;
	// http://www.giangrandi.ch/electronics/ntc/ntc.shtml
	//http://www.carelparts.com/manuals/ntc-specs.pdf page 8



		sprintf(Trtd, "Trtd = %0.2f\n\r", tmp);
    HAL_UART_Transmit(&huart1, (uint8_t *)Trtd, 60, TIMEOUT_VAL); // print RTD temperature

    /*transferring kelvin with 2 decimals to unsigned 16 bit*/

    tmp=tmp*100;
	resistanceRTD=resistanceRTD*100;
	*(TemperatureValues_K+9-CSnumber)=(unsigned short int)tmp;
	*(ResistanceValues_K+9-CSnumber)=(unsigned short int)resistanceRTD;

	sprintf(Trtd, "Temp in Array = %hu\n\r", TemperatureValues_K[9-CSnumber]);
	    HAL_UART_Transmit(&huart1, (uint8_t *)Trtd, 60, TIMEOUT_VAL); // print RTD temperature

	//HAL_Delay(200);
}
/* FROM TEMP CODE */

void receive_task(void *pvArgs) {

	uint8_t data_holder;
	uint8_t data_to_send;
	uint8_t ok_to_send;
	HAL_StatusTypeDef TransmitReturn;

	for(;;) {

		HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);
  		if(HAL_CAN_Receive(&hcan, CAN_FIFO0, 1000) != HAL_OK) { //Try to receive

  			HAL_UART_Transmit(&huart1, (uint8_t *)"Receiving error!!", strlen("Receiving error!!"), HAL_MAX_DELAY);
  			HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  		} else { //Succes!

  			data_holder = hcan.pRxMsg->Data[0];
  			//char buff[20];
  			if(data_holder == 255){
  				ok_to_send = 255;
  			}
  			else if( data_holder == 0xAA){
  				ok_to_send = 0;
  			}
  			while (ok_to_send == 255) {

  				int m;
  				for (m = 1; m < 11; m = m + 1){
  				hcan.pTxMsg->Data[0] = 00;
  				hcan.pTxMsg->Data[1] = m;
  				hcan.pTxMsg->Data[2] = 0x02;
  				hcan.pTxMsg->Data[3] = m;

  				HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);
  		  		if(HAL_CAN_Receive(&hcan, CAN_FIFO0, 5) != HAL_OK) { //Try to receive

  		  			HAL_UART_Transmit(&huart1, (uint8_t *)"Receiving error", strlen("Receiving error"), HAL_MAX_DELAY);
  		  			HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  		  		} else {
  	  			data_holder = hcan.pRxMsg->Data[0];
  	  			//char buff[20];
  	  			if(data_holder == 255){
  	  				ok_to_send = 255;
  	  			}
  	  			else if( data_holder == 0xAA){
  	  				ok_to_send = 0;
  	  				break;
  	  			}
  				//vTaskDelay(pdMS_TO_TICKS(100));
  		  		}

  				TransmitReturn = HAL_CAN_Transmit(&hcan, 5); //Try to transmit and get result

  				if (TransmitReturn == HAL_ERROR) { //We got an error
  				  	/* Transmitting Error */
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)"Failed to transmit", strlen("Failed to receive"), HAL_MAX_DELAY);
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  				} else if((TransmitReturn == HAL_TIMEOUT)){ //Timed out
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)"Timeout", strlen("Timeout"), HAL_MAX_DELAY);
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  				} else if((TransmitReturn == HAL_OK)){ //Everything worked
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)"Transmitting: ", strlen("Transmitting: "), HAL_MAX_DELAY);

  				  	data_to_send = hcan.pTxMsg->Data[3];

  				  	char trans_buff[20];
  				  	sprintf(trans_buff, "%i", data_to_send);
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)trans_buff, strlen(trans_buff), HAL_MAX_DELAY);
  				  	HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  				}
  				HAL_GPIO_TogglePin(LED1_GPIO_Port, LED1_Pin);

  				}

  			}
  			//sprintf(buff, "%i", data_holder);
  		//	HAL_UART_Transmit(&huart1, (uint8_t*)"Receiving: ", strlen("Receiving: "), HAL_MAX_DELAY);
  		//	HAL_UART_Transmit(&huart1, (uint8_t*)buff, strlen(buff), HAL_MAX_DELAY);
  		//	HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  		}
  		//vTaskDelay(pdMS_TO_TICKS(1000));
	}
}

void send_task(void *pvArgs) {

	uint8_t data_to_send;
	HAL_StatusTypeDef TransmitReturn;



	hcan.pTxMsg->Data[0] = 01;
	hcan.pTxMsg->Data[1] = 0x01;
	hcan.pTxMsg->Data[2] = 0x1B;

	for(;;) {



		TransmitReturn = HAL_CAN_Transmit(&hcan, 1000); //Try to transmit and get result

		if (TransmitReturn == HAL_ERROR) { //We got an error
		  	/* Transmitting Error */
		  	HAL_UART_Transmit(&huart1, (uint8_t*)"Failed to transmit", strlen("Failed to receive"), HAL_MAX_DELAY);
		  	HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

